---
kind: method
id: M:Autodesk.Revit.DB.Outline.AddPoint(Autodesk.Revit.DB.XYZ)
source: html/7338e8cf-442e-9623-b348-a44f904a6f9a.htm
---
# Autodesk.Revit.DB.Outline.AddPoint Method

Adds a point to the bounding box, expanding it if the point is outside the existing boundary.

## Syntax (C#)
```csharp
public void AddPoint(
	XYZ point
)
```

## Parameters
- **point** (`Autodesk.Revit.DB.XYZ`) - The point to add.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null